In [5]:
import pandas as pd
df=pd.read_csv(r"C:\Users\SRI AKHILA\dataset.csv")
df

   Study_Hours  Marks
0            0    2.9
1            1    5.8
2            2    4.7
3            3    4.0
4            4    1.8
5            5    1.8
6            6    1.3
7            7    5.3
8            8    4.0
9            9    4.5

In [6]:
df.isnull()

   Study_Hours  Marks
0        False  False
1        False  False
2        False  False
3        False  False
4        False  False
5        False  False
6        False  False
7        False  False
8        False  False
9        False  False

In [7]:
df.head()

   Study_Hours  Marks
0            0    2.9
1            1    5.8
2            2    4.7
3            3    4.0
4            4    1.8

In [8]:
df.tail()

   Study_Hours  Marks
5            5    1.8
6            6    1.3
7            7    5.3
8            8    4.0
9            9    4.5

In [9]:
df.shape

(10, 2)

In [10]:
df.columns

Index(['Study_Hours', 'Marks'], dtype='object')

In [11]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [12]:
df.dtypes

Study_Hours      int64
Marks          float64
dtype: object

In [13]:
df.info

<bound method DataFrame.info of    Study_Hours  Marks
0            0    2.9
1            1    5.8
2            2    4.7
3            3    4.0
4            4    1.8
5            5    1.8
6            6    1.3
7            7    5.3
8            8    4.0
9            9    4.5>

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Study_Hours  10 non-null     int64
 1   Marks        10 non-null     float64
dtypes: float64(1), int64(1)
memory usage: 292.0 bytes